app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "title", "updated_at", "user_id", "content") VALUES('2009-11-16 04:28:49', 'This is a test', '2009-11-16 04:28:49', 1, 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Maecenas convallis venenatis mi a hendrerit. Sed eu fermentum quam. Curabitur odio lacus, pulvinar quis facilisis et, posuere ut lorem. Nulla facilisi. Pellentesque ornare quam nec mauris interdum nec dignissim quam tincidunt. Sed scelerisque urna dictum arcu feugiat congue. Pellentesque eu ipsum et felis viverra bibendum sit amet sed lacus. In nec aliquam libero. Nulla porta, neque quis dignissim lacinia, risus nulla laoreet ligula, vitae ullamcorper nulla mauris a erat. Nulla ac augue nunc. Aenean vehicula fermentum fermentum. Duis vitae turpis felis, pharetra vestibulum libero. Aenean aliquet, neque nec ornare faucibus, sem dolor eleifend purus, ac posuere quam erat vel mauris. ')
---
  def create
    @article = Article.new(params[:article])
    @article.user_id = current_user.id

    respond_to do |format|
      if @article.save

SELECT * FROM "articles" WHERE ("articles"."id" = 2)
UPDATE "articles" SET "updated_at" = '2009-11-16 04:29:12', "content" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Maecenas convallis venenatis mi a hendrerit. Sed eu fermentum quam. Curabitur odio lacus, pulvinar quis facilisis et, posuere ut lorem. Nulla facilisi. Pellentesque ornare quam nec mauris interdum nec dignissim quam tincidunt. Sed scelerisque urna dictum arcu feugiat congue. Pellentesque eu http://melissa-brandon.com ipsum et felis viverra bibendum sit amet sed lacus. In nec aliquam libero. Nulla porta, neque quis dignissim lacinia, risus nulla laoreet ligula, vitae ullamcorper nulla mauris a erat. Nulla ac augue nunc. Aenean vehicula fermentum fermentum. Duis vitae turpis felis, pharetra vestibulum libero. Aenean aliquet, neque nec ornare faucibus, sem dolor eleifend purus, ac posuere quam erat vel mauris. ' WHERE "id" = 2
---
  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])