app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM "comments" ORDER BY created_at DESC

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 9) ORDER BY created_at DESC

  def related
    @comments = Comment.find_all_by_prayer_id(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."prayer_id" = '14') ORDER BY created_at DESC

  def create
    if !current_user
      redirect_to root_url
    end

    @comment = Comment.new(params[:comment])
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "updated_at", "user_id", "prayer_id") VALUES('Melissa is really beautiful! Melissa is really beautiful! Melissa is really beautiful! Melissa is really beautiful!

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1