app/controllers/prayers_controller.rb

  def update
    @prayer = Prayer.find(params[:id])

    # Ensure that the prayer belongs to the current user
    if !current_user || @prayer.user_id != current_user.id
      redirect_to root_url
    end

    respond_to do |format|
      if @prayer.update_attributes(params[:prayer])
---
UPDATE "users" SET "updated_at" = '2009-11-27 19:07:31', "last_request_at" = '2009-11-27 19:07:31' WHERE "id" = 1