app/controllers/prayers_controller.rb

  def index
    @prayers = Prayer.search(params[:search], params[:page], params[:per])
    @comments = Comment.all(:limit => 2)
---
SELECT * FROM "prayers" WHERE (prayer like '%wife%') ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "prayers" WHERE (prayer like '%%') LIMIT 10
SELECT * FROM "comments" ORDER BY created_at DESC LIMIT 2

  def commit
    @prayer = Prayer.find(params[:id])
    @prayer.increment!(:num_responses)
---
SELECT * FROM "prayers" WHERE ("prayers"."id" IS NULL) ORDER BY updated_at DESC LIMIT 1
UPDATE "prayers" SET "num_responses" = 1, "updated_at" = '2009-12-07 05:15:28' WHERE "id" = 65

  def show
    @prayer = Prayer.find(params[:id])
---
SELECT * FROM "prayers" WHERE ("prayers"."id" = 12) ORDER BY created_at DESC

  def edit
    @prayer = Prayer.find(params[:id])
---
SELECT * FROM "prayers" WHERE ("prayers"."id" = 3)

  def create
    if !current_user
      redirect_to root_url
    end

    @prayer = Prayer.new(params[:prayer])
    @prayer.user_id = current_user.id

    respond_to do |format|
      if @prayer.save
---
INSERT INTO "prayers" ("prayer", "created_at", "updated_at", "num_responses", "user_id") VALUES('Suspendisse et dictum velit. In viverra lorem ut metus porttitor interdum. Mauris mattis interdum ante, in vulputate tellus dignissim in. Fusce ut orci sit amet tortor aliquam ultricies. Morbi ac consectetur eros. Nam placerat iaculis augue, luctus volutpat elit scelerisque nec. Curabitur nec risus at libero eleifend commodo. Morbi libero libero, iaculis ut pulvinar quis, vestibulum a turpis. Nullam a dignissim eros. Mauris dui nisi, hendrerit non dictum pellentesque, convallis at velit. Nulla faucibus consequat venenatis. In sagittis feugiat risus non commodo. http://twitter.com Praesent sit amet justo mauris. Vestibulum ante ipsum primis in faucibus orci luctus et ultrices posuere cubilia Curae; Curabitur ac magna enim, sed luctus ligula. Praesent ornare interdum elementum. Nulla quis metus at justo sollicitudin ornare. Aliquam sed purus quam, ac commodo libero. Etiam volutpat pulvinar sollicitudin. Vivamus erat tellus, sagittis nec ultrices nec, ultricies id felis. ', '2009-11-16 04:22:37', '2009-11-16 04:22:37', 0, 1)

  def update
    @prayer = Prayer.find(params[:id])

    respond_to do |format|
      if @prayer.update_attributes(params[:prayer])
---
SELECT * FROM "prayers" WHERE ("prayers"."id" = 3)
UPDATE "prayers" SET "updated_at" = '2009-11-22 00:31:55', "prayer" = 'I love my wife! She is my most favorite! And baby is going to be born in a couple of hours!

  def destroy
    @prayer = Prayer.find(params[:id])
    @prayer.destroy
---
SELECT * FROM "prayers" WHERE ("prayers"."id" = 1)
DELETE FROM "prayers" WHERE "id" = 1