app/controllers/users_controller.rb

  def index
    @users = User.search(params[:search], params[:page], params[:per])
---
SELECT * FROM "users" WHERE (username like '%%') ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "users" WHERE (username like '%%')

  def show
    @user = User.find_by_username(params[:username])
---
SELECT * FROM "users" WHERE ("users"."username" = 'brandon') ORDER BY created_at DESC LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if verify_recaptcha(:model => @user, :message => "The scrambled words were incorrect") && @user.save
---
INSERT INTO "users" ("profile_pic_content_type", "location", "last_request_at", "created_at", "crypted_password", "postal_code", "updated_at", "profile_pic_file_name", "profile_pic_file_size", "username", "api_key", "profile_pic_updated_at", "lastname", "password_salt", "firstname", "persistence_token", "login_count", "last_login_at", "status", "email", "pic") VALUES(NULL, NULL, '2009-11-21 07:37:28', '2009-11-21 07:37:28', '4a40d8526b7ec2447d86843d0ce7067eae3c60431baa31e42065e340da36456e50298cfea31201ef8587491341a2a5dd7dad6ae3cd889557e16745952049850c', NULL, '2009-11-21 07:37:28', NULL, NULL, 'itsme', NULL, NULL, NULL, '0IIXMeJabBu7URpIILk8', NULL, '6930e0f5f7378f3608b44a98ea5e593c8e91830703671dac7516adf1d411ded4d4a1ce6c1faf4398450e2b54585f1bdfc35fafa6ab013747e002ef62b1d10724', 1, NULL, NULL, 'brandon@yahoo.com', NULL)

  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "login_count" = 6, "persistence_token" = '016070058cc9b391e5877433ecdc4a4706a019fe6a6414e2882ef5ca9c10cc4d7970c5b028a052d5364864129500db5bc521dd842f92ea5d516d80fe8624fa0d', "updated_at" = '2009-11-16 07:18:19', "last_request_at" = '2009-11-16 07:18:19', "password_salt" = '2jnCCghweP55ju-ndUh2', "crypted_password" = '0490d2b63624a068a9133943cf51ad22d2f2fc468a5178fe1be18969a854b4c3c773ee0b216852c30833f108ffbd813410372bae085267bd3530d5cc860c3b84' WHERE "id" = 1